BenchBnb/app/controllers/api/benches_controller.rb

  def create
    @bench = Bench.new(bench_params)
    if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng") VALUES ($1, $2, $3) RETURNING "id"  [["description", "mno"], ["lat", 37.751592], ["lng", -122.494609]]